#include<stdio.h>
 int main()
 {

    // int n = 9;
    // float* pfloat = (float*)&n;
    // printf("n的值为:%d\n", n);
    // printf("*pfloat的值为:%f\n", *pfloat);

    // *pfloat = 9.0;
    // printf("n的值为:%d\n", n);
    // printf("*pfloat的值为:%f\n", *pfloat);

// 浮点数的存储
    /*
    IEEE754标准存储浮点数 数据的存储怎么存 怎么拿出来
    (-1)^s*m*2^e

    5.0f
    101.000
    (-1)^0*1.01*2^2 s=0 m=1.01 e=2

    9.5f
    1001.1
    (-1)^0*1.0011*2^3 s=0 m=1.0011 e=3

    9.6f 不能完全存储 只能是接近
    sem
    32位 float
    s一位 e八位 m23位
    64位 double
    s一位 e十一位 m52位
    m = 1.xxxxxxx  m只需要存储后面的就行

    e 0-255    127中间值
    e 0-2047   1023中间值
    e 是unsigned类型的
    */

//    float f = 5.5f; 
   // 101.1= (-1)^0*1.011*2^2
   // 0100 0000 1011 0000 0000 0000 0000
   // 0x 40 b0 00 00


// 怎么取出来的办法
    /*      
    正常情况的 怎么放怎么取出来

    e为全一
    128+127=255 2^128   
    表示正负无穷大的  符号取决于符号位


    e为全零
    1-127
    1-1023
    m不在添加一 还原为1.XXXXX  就是为了表示正负
    */

    int n = 9;
    // 00000000000000000000000000001001
    // 0 00000000 00000000000000000001001
    // 正数 1-127=-126
    // 0.00000000000000000001001*2^-16
    float* pfloat = (float*)&n;
    printf("n的值为:%d\n", n);  // 9
    printf("*pfloat的值为:%f\n", *pfloat); // 0

    *pfloat = 9.0;
    //0 10000010 001000000000000000
    printf("n的值为:%d\n", n); // 
    printf("*pfloat的值为:%f\n", *pfloat); //









    return 0;
 }