#include<stdio.h>
#include<string.h>
int main()
{

// 数组是一组相同类型元素的集合
// 数组创建语法 数组类型 数组[常量表达式]
    // int arr[10];
    // double data1[20];
    // double data[15 + 4];
    // char ch[15];

// 错误示范
// int a = 10;
// scanf("%d", &a);
// int arr[a] = 10;  这种数组是不能初始化的

// c99之前数组的大小必须是常量或者常量表达式
// c99之后数组的大小可以是变量 为了支持边长数组


// 初始化

    // int arr[10] = {1, 2, 3, 4, 5};  // 不完全初始化 剩余默认的元素为零
    // char ch1[10] = {'a', 'b', 'c'}; // 默认初始化 '\0
    // char ch2[10] = "abc";              // 默认初始化放了一个 '\0'
    // char ch3[] = "abc";    // 字符串初始化默认 '\0'

// 数组元素的访问
// []下表引用操作
    int arr[] = {1,2,3,4,5,6,7,8,9,10};   // 栈区里面一块连续的空间,  空间 arr 开头的

    int sz = sizeof(arr) / sizeof(arr[0]);
    int i = 0; 
    // for(i = 0; i < sz; i++)
    // {
    //     printf("%d ", arr[i]);
    // }

    // for(i = sz-1; i >= 0; i--)  // 注意sz - 1 数组是从零开始的
    // {
    //     printf("%d ", arr[i]);
    // }

// 数组在内存里面的存储
// 数组在内存里面是连续存储的
    // int arr2[] = {1,2,3,4,5,6,7,8,9,10};   // 栈区里面一块连续的空间,  空间 arr 开头的
    // for(i = 0; i < sz; i++)
    // {
    //     printf("&arr[%d] = %p\n", i, &arr[i]);
    // }














    return 0;
}