#include<stdio.h>


int main()
{

// 数组的创建
    int arr1[3][3];
    char arr2[5][2];

// 初始化
    int arr3[3][4] = {{1,2,3,8},{4,5,6,5},{3,4,5,6}};
    int arr4[3][4] = {{1,2}, {4,2}, {44,5}};
    int arr[][5] ={1,2,3,4,5,6};     //初始化的列不能省略

// 访问元素和赋值
    // int i = 0;
    // int j = 0;
    // for(i = 0; i < 3; i++)
    // {
    //     for(j = 0; j < 4; j++)
    //     {
    //         printf("%d\n", arr3[i][j]);
    //     }
    // }

    // for(i = 0; i < 4; i++)
    // {
    //     for(j = 0; j < 3; j++)
    //     {
    //         printf("%d", arr3[j][i]);   // 竖着访问元素
    //     }
    //     printf("\n");
    // }

// 数据的存储
    // int i = 0;
    // int j = 0;
    // for(i = 0; i < 3; i++)
    // {
    //     for(j = 0; j < 4; j++)
    //     {
    //         printf("&arr[%d][%d] = %p\n", i, j, &arr3[i][j]);    // 数据也是连续的存储的
    //     }
    // }


// 二维数组理解成一维数组的数组
    /*
    1 2 3 4    arr[0][j] 访问元素  arr[0]一行的数组名
    2 4 5 6    arr[1][j] 访问元素  arr[1]二行的数组名
    3 4 5 6    arr[2][j] 访问元素  arr[2]三行的数组名
    */

   /*
   1 2 3 4    5 6 7 8      9 10 11 12
   arr[0]     arr[1]       arr[2]
   */


// 数组越界
    // 编译器不会检查越界 越界访问了自己去检查吧
    // 用数组长度去检查吧
    // 小心二维数组的越界 在自己范围越界

// 数组作为函数参数


    return 0;
}