#include<stdio.h>
int main()
{

// 算数操作符
// + - * /  %
// 注意整型和小数除法
// %只能是整型进行运算

    // int a = 7 % 2;
    // printf("%d\n", a);

// c语言深度解剖 蛋哥 负数取余数


// << >>  只能是二进制移动  只能是移动整数位
//  只能是整数
// 整数的二进制表示只有三种
// 源码 反码 补码
// 正数 源码=反码=补码
// 负数 源码 -->符号位不变 按位取反 --> 加一

// 7
// 00000000000000000000000000000111  源码
// 00000000000000000000000000000111  反码
// 00000000000000000000000000000111  补码

// -7
// 10000000000000000000000000000111 源码
// 11111111111111111111111111111000 反码
// 11111111111111111111111111111001 补码

// 整数在内存中是按照补码存储的
    //int a = 7;
    //int b = a << 1; // 实际上a没有变的  类似 b = a + 1;

// 7
// 00000000000000000000000000000111  补码
// 00000000000000000000000000001110
// 左边丢弃 右边补零

    // printf("a = %d\n", a);
    // printf("b = %d\n", b);

// -7
// 11111111111111111111111111111001  补码
// 11111111111111111111111111110010  移动一位
// 11111111111111111111111111110001  减一
// 10000000000000000000000000001110  取反


// gcc编译器是算术运算
// 右移操作符
// 算数移位:右边丢弃 左边补原来的符号位
// 逻辑移位:右边丢弃 左边补0
    int a = -7;
    int b = a >> 1;
    printf("a = %d\n", a);
    printf("b = %d\n", b);

// 7
// 00000000000000000000000000000111  补码
// 00000000000000000000000000000011  算术移位

    return 0;
}