#include<stdio.h>
int main()
{

// 位操作符 & | ^
// & 按位与
// | 按位或
// ^ 按位异或   相同位0 相异位1
// 也是整型
    // int a = 3;
    // int b = -5;
    // int c = a & b;
    // int d = a | b;
    // int e = a ^ b;
    // printf("c = %d \n", c);
    // printf("d = %d \n", d);
    // printf("e = %d \n", e);


// 00000000000000000000000000000011;

// 10000000000000000000000000000101;
// 11111111111111111111111111111010;
// 11111111111111111111111111111011;

// 00000000000000000000000000000011;
// 11111111111111111111111111111011;

// 00000000000000000000000000000011; 与
// 11111111111111111111111111111011; 或
// 11111111111111111111111111111000; 异或

// 11111111111111111111111111111010;
// 10000000000000000000000000000101;

// 11111111111111111111111111110111;
// 10000000000000000000000000001000;


// 不创建临时变量实现两个数的交换

// a ^ a = 0;
// 0 ^ a = a;
// 3 ^ 3 ^ 5 = 5;
// 3 ^ 5 ^ 5 = 5;
    // int a = 3;
    // int b = 5;

    // // int temp = a;
    // // a = b;
    // // b = temp;
    // // printf("a = %d\n", a);
    // // printf("b = %d\n", b);

    // // a = a + b;   // 会出现溢出
    // // b = a - b;   // a + b -b
    // // a = a - b;   // a + b -a;

    // a = a ^ b;
    // b = a ^ b;
    // a = a ^ b;

// 求补码二进制里面1的个数
    // int i = 0;
    // int a = 0;
    // int cout = 0;

    // scanf("%d", &a);
    // for(i = 0; i < 32; i++)
    // {
    //     if(a & 1)      // a & 1 按位与1可以得到最后一位的数字
    //     {
    //         cout++;
    //     }
    //     a = a >> 1;
    // }

    // printf("%d \n", cout);


// 赋值操作符 编程的世界里面=是赋值  ==是等于
// 不建议连续赋值的
    // int a = 3; // 初始化
    // a = 33; //赋值

// 符合赋值法
// += -= *= /= %=   >>=  <<=  &= |=  ^=
    // int a = 3;
    // a += 5; // a = a + 5;
    // a >>= 2; // a = a >> 2;


// 单目操作符 操作数只有一个的
// ! - + & sizeof ~ -- ++ * (强制类型转换)
    // int flag = 0;

    // if(!flag)     // !flag是假的近就入
    // {
    //     printf("hehe\n");
    // }

    // if(flag)     // !flag是真的的近就入
    // {
    //     printf("hehe\n");
    // }

// c语言零表示假的 非零表示真

// + -
    // int a = +10;
    // int b = -a;

// &
    // int a = 10;
    // printf("%p \n", &a);
    // int* p = &a;

// sizeof 操作符 计算的是类型或者变量所占空间的大小 就是字节
    // int a = 10;
    // int n = sizeof(int);
    // printf("n = %d \n", n);

// ~
    // int a = 0;
    // // 00000000000000000000000000000000 
    // // 11111111111111111111111111111111
    // // 11111111111111111111111111111110
    // // 10000000000000000000000000000001
    // printf("%d\n", ~a);

    // int a = 3;
    // // 0000000000000000000000000000011;
    // // 1111111111111111111111111111100;
    // // 1111111111111111111111111111011;
    // // 1000000000000000000000000000100;
    // printf("%d \n", ~a);

    // int a = 13;
    // // 第二位的0改成一 只需要或个1
    // // 000000000000000000000000000001101;
    // // 000000000000000000000000000000010;
    // // 000000000000000000000000000001111;
    // a |= (1<<1);
    // printf("%d \n", a);

    // a = 29;
    // // 000000000000000000000000000011101;
    // // 111111111111111111111111111101111;
    // // 000000000000000000000000000001101
    // a = a & (~((1 <<4)));
    // printf("%d \n", a);

// ++ -- easy

    // int a = 3;
    // // int b = ++a;     // 先加加 在赋值给b
    // int b = a++;        // 先赋值给b a在加加
    // printf("%d\n", a);
    // printf("%d\n", b);

    // int a = 3;
    // int b = --a;
    // printf("%d\n", a);
    // printf("%d\n", b);

    // a = 10;
    // printf("%d\n", a--);  // 先使用在减减 10
    // printf("%d\n", a);    // 9

// c语言++--这循环里面区别不大的
    // int i = 0;
    // for(i = 0; i < 10; i++)
    // {
    // }

// *间接访问操作符号
    // int a = 10;
    // int* p = &a;

    // // *p 就是 a
    // *p = 1010;  // 找到p指向的地址存放的数据
    // printf("%d \n", a);
    // printf("%d \n", *p);

// c++的引用 双刃剑流弊的很
// &和*配套使用

    // int  a = 3.14;       // 数据类型不对等 会警告您的
    // int  b = (int)3.14;  // 强制类型转换

    // printf("%d \n", sizeof a);    // sizeof是操作符
    // printf("%d \n", sizeof(int));  // 但是在计算类型 不能省略括号的


    // 40 4 10 4
    // 指针存放的是地址

// 关系操作符号
// >> >= < <= != ==
// 两个字符相比使用strcmp




    return 0;
}